experiment-finetuned/all_finetuned/runs/squareBend/2/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    // Block 0 - inlet straight section
    (-50 25 25)     // 0
    (-50 25 -25)    // 1
    (-50 -25 -25)   // 2
    (-50 -25 25)    // 3
    (25 25 25)      // 4
    (25 25 -25)     // 5
    (25 -25 -25)    // 6
    (25 -25 25)     // 7

    // Block 1 - bend section
    (25 0 25)       // 8
    (25 0 -25)      // 9
    (25 -50 -25)    // 10
    (25 -50 25)     // 11

    // Block 2 - outlet straight section
    (-500 -75 25)   // 12
    (-500 -75 -25)  // 13
    (-500 -125 -25) // 14
    (-500 -125 25)  // 15

    // Additional vertices at x=75 for proper block topology
    (75 -75 25)     // 16
    (75 -75 -25)    // 17
    (75 -125 -25)   // 18
    (75 -125 25)    // 19

    // Vertices at x=-500 for outlet block
    (-500 -75 25)   // 20
    (-500 -75 -25)  // 21
    (-500 -125 -25) // 22
    (-500 -125 25)  // 23
);

blocks
(
    hex (0 3 2 1 4 7 6 5) (20 20 1) simpleGrading (1 1 1)
    hex (4 7 11 8 16 19 18 17) (20 20 1) simpleGrading (1 1 1)
    hex (21 22 23 20 16 19 18 17) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (21 22 23 20)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (3 7 6 2)
            (7 11 10 6)
            (11 15 14 10)
            (16 19 18 17)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
            (4 7 11 8)
            (8 11 15 12)
            (16 19 18 17)
            (17 18 22 21)
            (16 17 21 20)
            (19 16 20 23)
            (18 19 23 22)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //