experiment-finetuned/all_finetuned/runs/squareBend/2/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        value           uniform 10;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 10;
        value           uniform 10;
    }

    walls
    {
        type            epsilonWallFunction;
        value           uniform 10;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //