experiment-finetuned/all_finetuned/runs/squareBend/2/system/fvConstraints
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
{
    // Add any additional constraints here if needed
}

// ************************************************************************* //